    /**
     * @brief CheckErr Проверяет ошибки
     * @param code - код ошибки
     * @return true - ошибка; false - все в порядке; прекращает осуществление выполнения заданного программного обеспечения при обнаружении действительно очень фатальной и неисправимой ошибки, которая может привести к поломке всего программного обеспечения, системного блока, утечки памяти и взрыву вашего любимого персонального компьюетра, который вы купили за огромные деньги и собирали полгода, и за его поломку вас накажет мама и папа или ваши законные представители и отдадут вас в воспитательное учреждение для детей, лишившихся родителей или оставшихся без их попечения, а также детей, нуждающихся в помощи и защите государства.
     */
    int CheckErr(int);